const comment = `Ти казала в понедiлок – пiдем разом по барвiнок.<br>
Я прийшов, тебе нема, пiдманула, пiдвела.<br>
Ти ж мене пiдманула, ти ж мене пiдвела.<br>
Ти ж мене, молодого, з ума розуму звела.<br>
<br>
Я казала у вiвторок – поцiлую разiв сорок.<br>
Ти прийшов, мене нема, пiдманула, пiдвела.<br>
Я ж тебе пiдманула, я ж тебе пiдвела.<br>
Я ж тебе, молодого, з ума розуму звела.<br>
<br>
Ти казала у середу – пiдем разом по череду.<br>
Я прийшов, тебе нема, пiдманула, пiдвела.<br>
Ти ж мене пiдманула, ти ж мене пiдвела.<br>
Ти ж мене, молодого, з ума розуму звела.<br>
<br>
Я казала у четвер – пiдем разом на концерт.<br>
Ти прийшов, мене нема, пiдманула, пiдвела.<br>
Ти ж мене пiдманула, ти ж мене пiдвела.<br>
Ти ж мене, молодого, з ума розуму звела.<br>
<br>
Ти казала у п’ятницю – пiдем разом по пшеницю.<br>
Я прийшов, тебе нема, пiдманула, пiдвела.<br>
Я ж тебе пiдманула, ти ж мене пiдвела.<br>
Ти ж його, молодого, з ума розуму звела.<br>

Я казала у суботу – пiдем разом на роботу.<br>
Я прийшов, тебе нема, пiдманула, пiдвела.<br>
Я ж тебе пiдманула, ти ж мене пiдвела.<br>
Ти ж його, молодого, з ума розуму звела.<br>
<br>
Я казала у недiлю – пiдем разом на весiлля.<br>
Я прийшов, тебе нема, пiдманула, пiдвела.<br>
Ти ж мене пiдманула, ти ж мене пiдвела.<br>
Ти ж мене, молодого, з ума розуму звела.<br>`;

const badWords = ['пiдманула', 'пiдвела', 'понедiлок', 'вiвторок', 'середу', 'четвер', 'п’ятницю', 'суботу', 'недiлю'];

let mutableComment = comment;

badWords.forEach(word => {
    const filter = new RegExp(word, 'gi');
    mutableComment = mutableComment.replace(filter, match => '*'.repeat(match.length));
});

document.body.innerHTML = `<p>${mutableComment}</p>`;